Q.1   Create a New Database and  Table for Employees

Task: Create a new database named and Create a table named with the following

Column Name     data type       constrait
employee_id        int           primary
first_name       vachar[50]
last_name        vachar[50]
department       vachar[50]
salary            int
hire_date         data

..> Employee Table Structure
Column Name	Data Type	Constraints
employee_id	INT	PRIMARY KEY
first_name	VARCHAR(50)	NOT NULL
last_name	VARCHAR(50)	NOT NULL
department	VARCHAR(50)
salary	DECIMAL(10,2)
hire_date	DATE
SQL CREATE TABLE Statement
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10,2),
    hire_date DATE
);

Explanation

INT: Used for numeric identifiers

VARCHAR(50): Stores text up to 50 characters

DECIMAL(10,2): Suitable for salary (up to 2 decimal places)

DATE: Stores date in YYYY-MM-DD format

PRIMARY KEY: Uniquely identifies each employee

Q.2  Insert Data into Employees Table

Task: Insert the following sample records into the table.
employees_id first_name last_name department salary

101     amit     sharma   HR        170000
102     raj      mehta    SALES     130000
103     riya     kapoor   IT        12000
104     neha     kumar    HR        120000
105     arjun    singh   FINANCE    12000

...> Given Records (Formatted)
employee_id	first_name	last_name	department	salary	hire_date
101	Amit	Sharma	HR	50000	2020-01-15
102	Riya	Kapoor	Sales	75000	2019-03-22
103	Raj	Mehta	IT	90000	2018-07-11
104	Neha	Verma	IT	85000	2021-09-01
105	Arjun	Singh	Finance	60000	2022-02-10
SQL INSERT INTO Statement
INSERT INTO employees
(employee_id, first_name, last_name, department, salary, hire_date)
VALUES
(101, 'Amit', 'Sharma', 'HR', 50000, '2020-01-15'),
(102, 'Riya', 'Kapoor', 'Sales', 75000, '2019-03-22'),
(103, 'Raj', 'Mehta', 'IT', 90000, '2018-07-11'),
(104, 'Neha', 'Verma', 'IT', 85000, '2021-09-01'),
(105, 'Arjun', 'Singh', 'Finance', 60000, '2022-02-10');

Q.3 Display All Employee Records Sorted by Salary (Lowest to Highest)

Hint: Use the  ORDER BY clause on the salary column.

..> To display all employee records sorted by salary from lowest to highest, use the ORDER BY clause with ASC (ascending) order.

SQL Query
SELECT *
FROM employees
ORDER BY salary ASC;

Explanation

SELECT * â†’ retrieves all columns

ORDER BY salary â†’ sorts by the salary column

ASC â†’ ascending order (default, so it can also be omitted)

âœ” This will show employees starting from the lowest-paid to the highest-paid.

Q.4  Show Employees Sorted by Department (Aâ€“Z) and Salary (High â†’ Low)


To show employees sorted first by Department (Aâ€“Z) and then by Salary (High â†’ Low), use ORDER BY with multiple columns.

SQL Query
SELECT *
FROM employees
ORDER BY department ASC, salary DESC;

Explanation

department ASC â†’ sorts departments alphabetically (Aâ€“Z)

salary DESC â†’ within each department, sorts salaries from highest to lowest

âœ” This groups employees by department and ranks them by salary within each department.

Q.5List All Employees in the IT Department, Ordered by Hire Date (Newest First)
..> 1ï¸âƒ£ Show Employees Sorted by Department (Aâ€“Z) and Salary (High â†’ Low)
SELECT *
FROM employees
ORDER BY department ASC, salary DESC;


Explanation:

department ASC â†’ sorts departments alphabetically (Aâ€“Z)

salary DESC â†’ within each department, higher salaries appear first

2ï¸âƒ£ List All Employees in the IT Department, Ordered by Hire Date (Newest First)
SELECT *
FROM employees
WHERE department = 'IT'
ORDER BY hire_date DESC;


Explanation:

WHERE department = 'IT' â†’ filters only IT employees

ORDER BY hire_date DESC â†’ most recently hired employees appear first.

Q.6 Create and Populate a Sales Table

Task: Create a table SALES to track sales data:

sale_id  customer-name  amount  sale_date

1          aditi         1500     2024-11-23
2          rohan         2200     2023-12-23
3          meena         3500     2024-12-24
4          aditi         2700     2012-12-24
5          rohan         4500     2023-12-23

..> 1ï¸âƒ£ Create the SALES Table
CREATE TABLE sales (
    sale_id INT PRIMARY KEY,
    customer_name VARCHAR(50),
    amount DECIMAL(10,2),
    sale_date DATE
);

Explanation

sale_id â†’ uniquely identifies each sale

customer_name â†’ name of the customer

amount â†’ sale amount

sale_date â†’ date of sale

2ï¸âƒ£ Insert the Given Records
INSERT INTO sales (sale_id, customer_name, amount, sale_date)
VALUES
(1, 'aditi', 1500, '2024-11-23'),
(2, 'rohan', 2200, '2023-12-23'),
(3, 'meena', 3500, '2024-12-24'),
(4, 'aditi', 2700, '2012-12-24'),
(5, 'rohan', 4500, '2023-12-23');

3ï¸âƒ£ (Optional) View the Data
SELECT * FROM sales;

Q.7  Display All Sales Records Sorted by Amount (Highest â†’ Lowest)

 Use ORDER BY amount Desc

 ..> 1ï¸âƒ£ Create the SALES Table
CREATE TABLE sales (
    sale_id INT PRIMARY KEY,
    customer_name VARCHAR(50),
    amount DECIMAL(10,2),
    sale_date DATE
);

2ï¸âƒ£ Insert the Given Records
INSERT INTO sales (sale_id, customer_name, amount, sale_date)
VALUES
(1, 'aditi', 1500, '2024-11-23'),
(2, 'rohan', 2200, '2023-12-23'),
(3, 'meena', 3500, '2024-12-24'),
(4, 'aditi', 2700, '2012-12-24'),
(5, 'rohan', 4500, '2023-12-23');

3ï¸âƒ£ Display Records Ordered by Amount (Highest to Lowest)
SELECT *
FROM sales
ORDER BY amount DESC;

ðŸ” Explanation

ORDER BY amount DESC â†’ sorts sales from highest amount to lowest

DESC = descending order

Q.8 . Show All Sales Made by Customer â€œAditiâ€

Hint: Use WHERE customer_name= " aditi"

..> 1ï¸âƒ£ Create and Populate the SALES Table
Create Table
CREATE TABLE sales (
    sale_id INT PRIMARY KEY,
    customer_name VARCHAR(50),
    amount INT,
    sale_date DATE
);

Insert Records
INSERT INTO sales (sale_id, customer_name, amount, sale_date)
VALUES
(1, 'aditi', 1500, '2024-11-23'),
(2, 'rohan', 2200, '2023-12-23'),
(3, 'meena', 3500, '2024-12-24'),
(4, 'aditi', 2700, '2012-12-24'),
(5, 'rohan', 4500, '2023-12-23');

2ï¸âƒ£ Display All Sales Sorted by Amount (Highest to Lowest)
SELECT *
FROM sales
ORDER BY amount DESC;


ðŸ”¹ This sorts sales starting from the highest amount.

3ï¸âƒ£ Show All Sales Made by Customer â€œAditiâ€
SELECT *
FROM sales
WHERE customer_name = 'aditi';


ðŸ”¹ This displays only records where the customer is Aditi.

Q.9 What is the Difference Between a Primary Key and a Foreign Key?

...> 6ï¸âƒ£ Difference Between Primary Key and Foreign Key
Feature	Primary Key	Foreign Key
Purpose	Uniquely identifies a record	Links one table to another
Uniqueness	Must be unique	Can have duplicate values
NULL values	Not allowed	Allowed
Number per table	Only one	Multiple allowed
Reference	Identifies records in same table	Refers to primary key of another table
Example
-- Primary Key
employee_id INT PRIMARY KEY

-- Foreign Key
employee_id INT,
FOREIGN KEY (employee_id) REFERENCES employees(employee_id).


Q.10  What Are Constraints in SQL and Why Are They Used?

..> Constraints are rules applied to table columns to control the type and validity of data that can be stored.

Common SQL Constraints
Constraint	Purpose
PRIMARY KEY	Uniquely identifies each record
FOREIGN KEY	Links tables and maintains relationships
NOT NULL	Prevents NULL values
UNIQUE	Ensures all values are different
CHECK	Enforces a condition
DEFAULT	Sets a default value
Why Constraints Are Used

âœ” Maintain data accuracy

âœ” Prevent invalid data entry

âœ” Ensure data consistency

âœ” Enforce business rules

âœ” Maintain database integrity

Example
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    salary DECIMAL(10,2) CHECK (salary > 0),
    department VARCHAR(50) NOT NULL
);


ðŸ“Œ In short:

Primary Key & Foreign Key maintain relationships

Constraints keep data clean, valid, a reliable.